---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.RunBottomUnderStairsBottomFailure
source: html/b63070fe-268c-2729-126f-2ff49aff9a92.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.RunBottomUnderStairsBottomFailure Property

Run bottom elevation should not be below the stairs bottom elevation.

## Syntax (C#)
```csharp
public static FailureDefinitionId RunBottomUnderStairsBottomFailure { get; }
```